CSI API ETABS v1
cSapModel Methods
The cSapModel type exposes the following members.
Methods
Name | Description
GetDatabaseUnits
 Returns a value from the eUnits enumeration indicating the database units for the model. All data is internally stored in the model in these units and converted to the present units as needed.
GetDatabaseUnits_2
 Retrieves the database units for the model. All data is internally stored in the model in these units and converted to the present units as needed.
GetMergeTol
GetModelFilename
 Returns a string that represents the filename of the current model, with or without the full path.
GetModelFilepath
 Returns the filepath of the current model
GetModelIsLocked
GetPresentCoordSystem
GetPresentUnits
 Returns a value from the eUnits enumeration indicating the units presently specified for the model.
GetPresentUnits_2
 Retrieves the present units for the model
GetProgramInfo
 Retrieve information about the program
GetProjectInfo
 Retrieves the project information data.
GetVersion
 Returns the program version.
InitializeNewModel
 This function clears the previous model and initializes the program for a new model. If it is later needed, you should save your previous model prior to calling this function.
SetMergeTol
SetModelIsLocked
 Locks or unlocks the model.
SetPresentUnits
 Sets the present units.
SetPresentUnits_2
 Sets the present units for the model
SetProjectInfo
 Sets the data for an item in the project information.
TreeIsUpdateSuspended
TreeResumeUpdateData
TreeSuspendUpdateData
Top
See Also
Reference
cSapModel Interface
ETABSv1 Namespace